{
  "default": [
    "Your love life is like Nairobi traffic - not moving anytime soon!",
    "Even AI can't find your match. Try offline!",
    "Your phone isn't the only thing that's single."
  ],
  "Kikuyu": [
    "As a Kikuyu, love might be expensive - have you checked your budget?",
    "Your future partner is still calculating dowry requirements.",
    "Ngai! Even the ancestors are worried about your single status."
  ],
  "Luhya": [
    "As a Luhya, you're still deciding whether to serve chicken at your wedding or eat it first.",
    "Your love life is as complicated as planning a Luhya introduction ceremony.",
    "You might find love faster if you promise unlimited ugali."
  ],
  "Kalenjin": [
    "As a Kalenjin, you keep running from love like it's a marathon.",
    "Your heart's faster than Kipchoge - no one can catch it.",
    "Even cows in Eldoret are asking when you'll settle down."
  ],
  "Luo": [
    "As a Luo, your love boat is still stuck at the pier - looking stylish though.",
    "Your jaber is still busy upgrading her vibe.",
    "Love needs more than swag, my friend."
  ],
  "Kamba": [
    "As a Kamba, even your mbee hasn't found you a match yet.",
    "Your love life is drier than Ukambani during drought.",
    "Kithitu is working overtime but still no results!"
  ],
  "Kisii": [
    "As a Kisii, you're taking love seriously - maybe too seriously.",
    "Even soap operas in Kisii are faster than your love life.",
    "Are you waiting for clan approval first?"
  ],
  "Meru": [
    "As a Meru, you're busy farming instead of dating.",
    "Even miraa gets delivered faster than your relationship status.",
    "Love is ripening... very slowly."
  ],
  "Maasai": [
    "As a Maasai, your love life is as wild as the savannah.",
    "Jump higher, maybe you'll spot your soulmate.",
    "Even the lions are asking when you'll find your queen."
  ],
  "Turkana": [
    "As a Turkana, love is like water - precious and rare.",
    "Your heart's still trekking across the desert.",
    "Maybe your soulmate is chilling at Lake Turkana."
  ],
  "Embu": [
    "As an Embu, you've planted the seeds of love but forgotten to water them.",
    "Maybe try farming hearts instead of tea.",
    "Love is waiting at the river, not on the shamba."
  ],
  "Taita": [
    "As a Taita, you're waiting for the love rain to fall on your hills.",
    "Your soulmate took a wrong turn at Voi.",
    "Maybe climb a hill and look harder."
  ],
  "Somali": [
    "As a Somali, your love life is full of adventure and a little bit of spice.",
    "Even your camel is tired of carrying your single status.",
    "You're searching for love like you're in a desert caravan."
  ],
  "Mijikenda": [
    "As a Mijikenda, your love life is still gathering coconuts.",
    "You're waiting for a love song from the Kaya forests.",
    "Maybe dance a little more, love likes rhythm."
  ],
  "Samburu": [
    "As a Samburu, love is a distant mountain.",
    "Maybe you're too busy being a moran.",
    "Your heart is still guarding cattle instead of falling in love."
  ],
  "Pokot": [
    "As a Pokot, love is a long walk to find the right cattle trader.",
    "Maybe your dowry list scared everyone away.",
    "Even the goats are gossiping about your single status."
  ],
  "Teso": [
    "As a Teso, love is like waiting for rain - unpredictable.",
    "Your heart is fertile but the rains are delayed.",
    "Maybe a love song from Tororo will speed things up."
  ],
  "Kuria": [
    "As a Kuria, you’re stubborn with your heart.",
    "Love needs fewer negotiations and more smiles.",
    "Maybe your soulmate is lost between Migori and Serengeti."
  ],
  "Rendille": [
    "As a Rendille, your love life is a long caravan journey.",
    "Maybe your soulmate took the wrong desert path.",
    "Love needs more than camel speed."
  ],
  "Borana": [
    "As a Borana, your love life is moving like a nomadic herd.",
    "Maybe pitch your heart's tent somewhere warmer.",
    "Even the camels are wondering when you'll settle down."
  ],
  "Bajuni": [
    "As a Bajuni, your love is sailing slowly across the ocean.",
    "Maybe your soulmate missed your dhow.",
    "Sauti ya bahari inaimba upendo, but you're not listening."
  ],
  "Tharaka": [
    "As a Tharaka, your love story is growing as slowly as millet.",
    "Maybe you're waiting for harvest season.",
    "Even your neighbors are whispering about your singlehood."
  ],
  "Swahili": [
    "As a Swahili, your love poems are sweet, but where's the action?",
    "Even your mahamri are tired of waiting for a wedding.",
    "Sauti ya moyo iko polepole kama taarab."
  ],
  "Gabra": [
    "As a Gabra, love feels like herding across deserts.",
    "Maybe your soulmate is at the next oasis.",
    "Your heart is dry, but hope is wet."
  ],
  "Orma": [
    "As an Orma, your love life is as calm as the Tana River - sometimes flooded, sometimes dry.",
    "Your soulmate might be fishing elsewhere.",
    "Cast your love net wider!"
  ],
  "Taveta": [
    "As a Taveta, love is hiding behind the bananas.",
    "Maybe your soulmate took a shortcut through Tanzania.",
    "Even Mount Kilimanjaro is waiting for your love story."
  ],
  "Dasanach": [
    "As a Dasanach, your love life is still herding cattle upstream.",
    "Maybe your partner is stuck in Ethiopia.",
    "Cross the river; love might be on the other side."
  ],
  "Burji": [
    "As a Burji, your love is calculated like your business deals.",
    "Maybe love isn't a trade deal.",
    "Try investing more heart than profit margins."
  ],
  "Suba": [
    "As a Suba, love is still sailing on Lake Victoria.",
    "Maybe you're fishing for the wrong catch.",
    "Row harder; your soulmate is floating nearby."
  ],
  "Awer": [
    "As an Awer, love hides like a secret in the Boni forest.",
    "Maybe you're too quiet for your soulmate to hear.",
    "Even the trees are whispering about you."
  ],
  "Galla": [
    "As a Galla (Oromo), love is strong but stubborn.",
    "Maybe you're fighting the wrong battles.",
    "Your soulmate might need a peace treaty first."
  ],
  "Malakote": [
    "As a Malakote, love is slow like a river meander.",
    "Maybe your soulmate is stuck upstream.",
    "Patience, love flows downstream eventually."
  ],
  "Sakuye": [
    "As a Sakuye, your love story needs less desert wind and more direction.",
    "Maybe your soulmate is hiding behind the dunes.",
    "Look past the horizon - love is waiting."
  ],
  "Degodia": [
    "As a Degodia, you're negotiating peace, but have you negotiated love?",
    "Maybe your soulmate needs a better offer.",
    "Even the elders are asking when you'll settle down."
  ],
  "Ajuran": [
    "As an Ajuran, your heart is strong but heavily guarded.",
    "Maybe drop the fortress and build a bridge.",
    "Even the camels are tired of single journeys."
  ],
  "Shona": [
    "As a Shona, your love life is rebuilding slowly, brick by brick.",
    "Maybe your soulmate is still stuck in Zimbabwe.",
    "Patience, even strong walls take time to build."
  ],
  "Nubi": [
    "As a Nubi, your love life is wandering like the Nile.",
    "Maybe your soulmate is swimming against the current.",
    "Go with the flow - love will find you."
  ],
  "Kenyan Arabs": [
    "As a Kenyan Arab, love is a spice market - colorful but confusing.",
    "Maybe too many choices slowed you down.",
    "Pick one before Ramadan comes again."
  ],
  "Ogiek": [
    "As an Ogiek, love is hiding deep in the forest.",
    "Maybe you need to come out of hiding.",
    "Even the honey bees are buzzing about your singlehood."
  ],
  "Yaaku": [
    "As a Yaaku, love is an endangered species.",
    "Maybe you need to make more noise.",
    "Don't let your love language go extinct!"
  ],
  "El Molo": [
    "As an El Molo, love is rare but precious.",
    "Maybe your soulmate is fishing elsewhere.",
    "Cast a wider net - love is swimming near."
  ],
  "Waata": [
    "As a Waata, your love life is a silent hunt.",
    "Maybe you're too stealthy for your soulmate to notice.",
    "Shout louder - love might be nearby!"
  ]
}